## SQL Server Buildin 函数

* 内置函数，<br>
* 注意聚合函数忽略null 值

*转换函数，例子*

In [4]:
%load_ext sql
%config SqlMagic.autocommit=True
%sql mssql+pyodbc://sa:Lily870104@MSSQLTest

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [6]:
%%sql use test1;
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.
Done.

[]

In [8]:
%%sql select cast('10' as int) * 20 as cast_ver,
    convert(int, '10') * 20 as convert_ver;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(200, 200)]

* Cast的时候有问题，怎么办
* CAST failed会返回一个error
* TRY_CONVERT 失败会返回NULL

In [12]:
%%sql select try_cast('A100' as int) * 20 as trycast_ver,
    try_convert(int, 'X100') * 20 as tryconvert_ver;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(None, None)]

In [14]:
%sql select cast('A100' as int) * 20 as errorcast_var

 * mssql+pyodbc://sa:***@MSSQLTest
(pyodbc.DataError) ('22018', "[22018] [Microsoft][ODBC Driver 18 for SQL Server][SQL Server]Conversion failed when converting the varchar value 'A100' to data type int. (245) (SQLExecDirectW)")
[SQL: select cast('A100' as int) * 20 as errorcast_var]
(Background on this error at: https://sqlalche.me/e/20/9h9h)

*  Logical Functions

* Choose函数的index从1开始

In [16]:
%sql select choose(3, 'Test', 'Zest', 'Rest', 'Nest')

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[('Rest',)]

* index =0 或者5 都会return NULLvalue

In [18]:
%sql select choose(5, 'Test', 'Zest', 'Rest', 'Nest');

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(None,)]

* 逻辑函数，其他例子

In [21]:
%sql select choose(2, 'A', 'B', 'C');

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[('B',)]

* 只考虑整数部分，返回'A'

In [23]:
%sql select choose(1.4, 'A', 'B', 'C');

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[('A',)]

In [25]:
%sql select choose(1.7, 'A', 'B', 'C');

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[('A',)]

In [27]:
%sql select iif(1 > 10, 'TRUE', 'FALSE');

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[('FALSE',)]

In [29]:
%sql select iif(10 > 1, 'TRUE', 'FALSE') as RESULTSET;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[('TRUE',)]

* Math Functions [数学函数]
* 一个SQL搞定所有数学函数

In [31]:
%%sql select abs(-10) as 'ABS', rand() as 'RAND', exp(4) as 'EXP',
    floor(4.66) as 'FLOOR', ceiling(4.33) as 'CEILING', 
    sign(-8) as 'SIGN', sqrt(2.56) as 'SQRT',
    square(4) as 'SQUARE', power(2, 3) as 'POWER',
    round(2.5677888, 2) as 'ROUND';

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(10, 0.33884787225801855, 54.598150033144236, Decimal('4'), Decimal('5'), -1, 1.6, 16.0, 8, Decimal('2.5700000'))]

* sqrt

In [33]:
%sql select sqrt(16)

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(4.0,)]

* 加减乘除也可以

In [35]:
%sql select sqrt(16) * square(4);

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(64.0,)]

In [37]:
%sql select sqrt(16) + square(4) as RESULTSET;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(20.0,)]

* 数学函数还可以嵌套

In [40]:
%sql select abs(sqrt(16) - square(4)) as RESULTSET;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(12.0,)]

* power函数及其等价

In [43]:
%sql select power(2, 4)

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(16,)]

In [45]:
%sql select 2*2*2*2;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(16,)]

* Aggregate Functions

* 求deptno的平均数，没什么实际的业务语义

In [50]:
%sql select avg(dept_no) from dept;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(25,)]

* 如果想要看唯一值的平均值，可以这样写

In [52]:
%sql select avg(distinct dept_no) from dept;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(25,)]

* 求平均工资

In [55]:
%sql select avg(salary) from employee;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(Decimal('190000.0000'),)]

* Count函数
* Count函数不考虑null

In [57]:
%sql select count(salary) from employee;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(3,)]

In [59]:
%sql select * from employee;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1001, 'Allen', 'Finch', None, None, None, 'J7', 10, None),
 (1002, 'Scott', 'Tigger', 1001, None, None, 'J2', 10, None),
 (1003, 'Martin', 'Blake', 1001, None, None, 'J3', 10, None),
 (1004, 'Arun', 'Turner', None, None, datetime.date(2008, 6, 5), 'J4', 20, Decimal('40000.0000')),
 (1005, 'John', 'Root', 1004, None, datetime.date(2010, 1, 10), 'J5', 20, None),
 (1006, 'Nithya', 'Jones', 1001, None, datetime.date(1999, 2, 12), 'J6', 30, Decimal('500000.0000')),
 (1007, 'Smith', 'Ruth', 1006, None, datetime.date(2010, 7, 21), 'J1', 10, Decimal('30000.0000')),
 (1008, 'Miller', 'Ward', 1001, None, None, 'J8', 40, None),
 (1009, 'Alex', 'Fin', None, None, None, 'J7', 30, None)]

In [61]:
%sql select count(*) from employee;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(9,)]

In [63]:
%sql select count(distinct salary) from employee;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(3,)]

* 查询最高工资

In [65]:
%sql select max(salary) from employee;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(Decimal('500000.0000'),)]

* max 函数

In [67]:
%sql select max(loc) as location from dept;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[('Hyberadad',)]

* 聚合函数，例子
* 下面两个都是跟group by 一起使用的

In [69]:
%sql select dept_no, count(*) from employee group by dept_no;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(10, 4), (20, 2), (30, 2), (40, 1)]

In [71]:
%%sql select dept_no, avg(salary) as AVGSAL, min(salary) as MINSAL, max(salary) as MAXSAL, 
    SUM(salary) as SUMSAL from employee
    group by dept_no
    having sum(salary) > 3000;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(10, Decimal('30000.0000'), Decimal('30000.0000'), Decimal('30000.0000'), Decimal('30000.0000')),
 (20, Decimal('40000.0000'), Decimal('40000.0000'), Decimal('40000.0000'), Decimal('40000.0000')),
 (30, Decimal('500000.0000'), Decimal('500000.0000'), Decimal('500000.0000'), Decimal('500000.0000'))]

* String 函数
* CHARINDEX比较复杂一点，字符串查找，其他都还好

In [73]:
%%sql select replace('abcdefghicde', 'cde', 'xxx') as REPLACE,
    substring('abcdef', 2, 3) as SUBSTR, 
    left('abcdefg', 2) as 'LEFT',
    right('abcdefg', 2) as 'RIGHT';

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[('abxxxfghixxx', 'bcd', 'ab', 'fg')]

In [75]:
%%sql declare @d datetime  = '10/01/2011'
    select format(@d, 'd', 'en-US') as 'US English',
    format(@d, 'd', 'en-gb') as 'Great Britain English',
    format(@d, 'd', 'de-de') as 'German';

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[('10/1/2011', '01/10/2011', '01.10.2011')]

* REVERSE 函数例子

In [77]:
%sql select reverse('ABC') as REVERSESTRING;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[('CBA',)]

In [79]:
%sql select ltrim('   abc');

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[('abc',)]

* LOWER函数

In [89]:
%sql select LOWER ('   abc   ') as 'LOWER';

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(' abc ',)]

In [92]:
%sql select UPPER('   abc   ') as 'UPPER';

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(' ABC ',)]

* DateTime 函数
* year代表年份，mm代表月份，dd代表天

In [105]:
%%sql select sysdatetime() as 'SYSDATETIME',
    datepart(year, '12-DEC-2017') as 'DATEPART',
    datediff(mm, '12/31/2015', '10/23/2016') as 'DATEDIFF',
    dateadd(mm, 2, '12/31/2015') as 'DATEADD';

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(datetime.datetime(2024, 1, 15, 9, 26, 15, 619734), 2017, 10, datetime.datetime(2016, 2, 29, 0, 0))]

* 分开的例子

In [107]:
%sql select datepart(mm, '12-DEC-2017');

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(12,)]

* DateAdd

In [109]:
%sql select dateadd(mm, 2, '12/31/2015');

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(datetime.datetime(2016, 2, 29, 0, 0),)]

* dd也可以

In [111]:
%sql select dateadd(dd, 2, '12/31/2015');

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(datetime.datetime(2016, 1, 2, 0, 0),)]

* groupby 需要有除了聚合函数外的所有列

In [114]:
%%sql select dept_no as department_no, count(*) as count from dept
    group by dept_no;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(10, 1), (20, 1), (30, 1), (40, 1)]

* Loc不在聚合函数里面，也不在groupby里面，不行

In [116]:
%%sql select dept_no, loc, count(*) as count from dept
    group by dept_no;

 * mssql+pyodbc://sa:***@MSSQLTest
(pyodbc.ProgrammingError) ('42000', "[42000] [Microsoft][ODBC Driver 18 for SQL Server][SQL Server]Column 'dept.loc' is invalid in the select list because it is not contained in either an aggregate function or the GROUP BY clause. (8120) (SQLExecDirectW)")
[SQL: select dept_no, loc, count(*) as count from dept
    group by dept_no;]
(Background on this error at: https://sqlalche.me/e/20/f405)

* 两个都包含在 groupby中就可以

In [118]:
%%sql select dept_no, loc, count(*) as count from dept
    group by dept_no, loc;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(10, 'Chennai', 1),
 (20, 'Hyberadad', 1),
 (30, 'Bangalore', 1),
 (40, 'Chennai', 1)]

* GroupBy的另一个例子

In [122]:
%%sql select job_title, count(*) from employee 
    group by job_title;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[('J1', 1),
 ('J2', 1),
 ('J3', 1),
 ('J4', 1),
 ('J5', 1),
 ('J6', 1),
 ('J7', 2),
 ('J8', 1)]

In [123]:
%sql select top(3) * from employee;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1001, 'Allen', 'Finch', None, None, None, 'J7', 10, None),
 (1002, 'Scott', 'Tigger', 1001, None, None, 'J2', 10, None),
 (1003, 'Martin', 'Blake', 1001, None, None, 'J3', 10, None)]

* Groupby having
* 单个记录，使用where语句过滤
* 聚合记录，使用having 语句过滤

In [124]:
%%sql select job_title, count(*) from employee
    group by job_title
    having min(salary) > 30000;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[('J4', 1), ('J6', 1)]